app/controllers/posts_controller.rb

UPDATE "posts" SET "updated_at" = ?, "views" = ? WHERE "posts"."id" = ?  [["updated_at", "2022-08-01 06:44:07.218997"], ["views", 1], ["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."created_at" DESC  [["post_id", 1]]
---
  def show
    @post.update(views: @post.views + 1)
    @comments = @post.comments.order(created_at: :desc)

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "views", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save

UPDATE "notifications" SET "read_at" = ? WHERE (json_extract(params, '$.post') = '{"_aj_globalid":"gid://blog-demo/Post/1"}') AND "notifications"."recipient_type" = ? AND "notifications"."recipient_id" = ?  [["read_at", "2022-08-01 10:44:42.536519"], ["recipient_type", "User"], ["recipient_id", 1]]
---
    def mark_notifications_as_read
      if current_user
        notifications_to_mark_as_read = @post.notifications_as_post.where(recipient: current_user)
        notifications_to_mark_as_read.update_all(read_at: Time.zone.now)