app/models/comment.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def notify_recipient
    CommentNotification.with(comment: self,post: post).deliver_later(post.user)